# Börsenkurse kompilieren

In [20]:
import pandas as pd

In [21]:
import glob

## Dateien laden

**Liste der Dateien erstellen**

In [22]:
path = 'Bluechips/'

In [23]:
filenames = glob.glob(path + '*.csv')

In [24]:
filenames[0]

'Bluechips/ZURN.SW.csv'

**Liste von Dataframes mit den Dateien**

In [25]:
dfs = []

In [26]:
dfs = [pd.read_csv(filename) for filename in filenames]

## Daten aggregieren

**Spalte mit Company Name hinzufügen**

In [27]:
for df, filename in zip(dfs, filenames):
    df['Ticker'] = filename
    df['Ticker'] = df['Ticker'].str.extract(path + '(.+).SW.csv')

In [28]:
dfs[0].head(2)

,Date,Open,High,Low,Close,Adj Close,Volume,Ticker
0,2014-10-13,276.600006,280.100006,275.700012,279.000000,208.469727,508243,ZURN
1,2014-10-14,277.500000,278.500000,275.299988,277.600006,207.423630,669957,ZURN

**Daten aneinanderreihen**

In [34]:
df_all = pd.concat(dfs, ignore_index=True)

In [35]:
df_all.head(2)

,Date,Open,High,Low,Close,Adj Close,Volume,Ticker
0,2014-10-13,276.600006,280.100006,275.700012,279.000000,208.469727,508243.0,ZURN
1,2014-10-14,277.500000,278.500000,275.299988,277.600006,207.423630,669957.0,ZURN

In [36]:
df_all.tail(2)

,Date,Open,High,Low,Close,Adj Close,Volume,Ticker
34265,2019-10-10,260.000000,261.899994,253.500000,256.700012,256.700012,415185.0,UHR
34266,2019-10-11,257.899994,263.500000,254.800003,262.799988,262.799988,477140.0,UHR

**Name für Ticker hinzufügen**

In [37]:
df_names = pd.read_csv('company_names.csv')

In [38]:
df_names.head(2)

   Company Ticker
0  ABB LTD   ABBN
1   ADECCO   ADEN

In [40]:
df_all_m = df_all.merge(df_names, how='left', on='Ticker')

**Spalte Close auswählen und Pivot**

In [43]:
df_pivoted = df_all_m.pivot(index='Date', columns='Company', values='Close')

In [44]:
df_pivoted.head(2)

Company,ABB LTD,ADECCO,ALCON,AMS,CLARIANT,CS GROUP,GEBERIT,GIVAUDAN,JULIUS BAER,KUEHNE+NAGEL INT,...,SIKA,SONOVA,SWATCH GROUP,SWISS LIFE HOLDING,SWISS RE,SWISSCOM,TEMENOS,UBS GROUP,VIFOR,ZURICH INSURANCE
Date,,,,,,,,,,,,,,,,,,,,,
2014-10-13,19.65,60.400002,NaN,NaN,15.54,23.689699,289.799988,1461.0,39.50,117.300003,...,51.849998,143.899994,436.100006,211.899994,73.650002,531.5,32.0,15.30,74.449997,279.000000
2014-10-14,19.76,60.700001,NaN,NaN,15.58,23.689699,294.399994,1478.0,39.77,118.400002,...,52.716702,138.399994,435.299988,211.100006,73.050003,530.0,32.5,15.33,75.000000,277.600006

In [45]:
df_pivoted.rename_axis(None, inplace=True)

In [46]:
df_pivoted.rename_axis(None, inplace=True)

In [47]:
df_pivoted.head(2)

Company,ABB LTD,ADECCO,ALCON,AMS,CLARIANT,CS GROUP,GEBERIT,GIVAUDAN,JULIUS BAER,KUEHNE+NAGEL INT,...,SIKA,SONOVA,SWATCH GROUP,SWISS LIFE HOLDING,SWISS RE,SWISSCOM,TEMENOS,UBS GROUP,VIFOR,ZURICH INSURANCE
2014-10-13,19.65,60.400002,NaN,NaN,15.54,23.689699,289.799988,1461.0,39.50,117.300003,...,51.849998,143.899994,436.100006,211.899994,73.650002,531.5,32.0,15.30,74.449997,279.000000
2014-10-14,19.76,60.700001,NaN,NaN,15.58,23.689699,294.399994,1478.0,39.77,118.400002,...,52.716702,138.399994,435.299988,211.100006,73.050003,530.0,32.5,15.33,75.000000,277.600006

In [48]:
df_pivoted.tail(2)

Company,ABB LTD,ADECCO,ALCON,AMS,CLARIANT,CS GROUP,GEBERIT,GIVAUDAN,JULIUS BAER,KUEHNE+NAGEL INT,...,SIKA,SONOVA,SWATCH GROUP,SWISS LIFE HOLDING,SWISS RE,SWISSCOM,TEMENOS,UBS GROUP,VIFOR,ZURICH INSURANCE
2019-10-10,18.125,54.119999,56.060001,42.970001,20.150000,11.610,466.000000,2795.0,42.240002,148.949997,...,153.149994,224.5,256.700012,470.600006,103.000000,500.399994,164.750000,10.720,160.949997,383.000000
2019-10-11,18.475,56.139999,56.200001,44.259998,20.690001,12.055,472.799988,2840.0,44.139999,151.800003,...,157.300003,227.5,262.799988,482.100006,103.550003,506.000000,171.050003,11.105,155.949997,388.799988

## Daten exportieren

In [49]:
df_pivoted.to_csv('smi_members.csv')